Revit 2026 API

# IConnectorWidth Property

---

The width of the connector.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
double Width { get; }
```
```vb
ReadOnly Property Width As Double
	Get
```
```cpp
property double Width {
	double get ();
}
```
```fsharp
abstract Width : float with get
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown when the connector's shape is not rectangular. |

This property is used to retrieve the width of the connector.

#### Reference

IConnector Interface

Autodesk.Revit.DB Namespace